// Battle of Sea.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.


#include <iostream>
#include <string>
using namespace std;

class ship
{
public:
    int health;
    string name;
};

class point 
{
public:
    int x;
    int y;
};

int main()
{
    ship one;
    one.health = 1;

    ship two;
    one.health = 2;

    ship three;
    one.health = 3;

    ship four;
    one.health = 4;

    ship five;
    one.health = 5;
}